$(document).ready(function() {
	Kakao.init('c4face53aa4246931bd469a4a674ef37');
	
	$('#kakao-naksi').on('click', kakaoNaksi);
	$('#kakao-terror').on('click', kakaoTerror);
	
});

var kakaoNaksi = function() {
	var n = 3;
	
	var messages = [
		['우리학교에서 일어난 살인사건', '확인하기'], 
		['100% 당첨 이벤트 1분 후부터 5분동안만!', '참여하기'], 
		['요즘 화제의 아이돌 K씨 실명 공개...', '기사읽기'], 
		['쿠폰이 발급되었습니다.', '사용하기'], 
		['우리학교 불났다는게 사실?', '기사보기'], 
		['나 전학가...', '댓글보기'], 
		['고백할게 있는데...', '고백의 민족에서 확인하기'], 
		['나 사실 있잖아...', '고백의 민족에서 확인하기'], 
		['나랑 썸탈래?', '고백의 민족에서 확인하기'], 
		['보고싶다...', '고백의 민족에서 확인하기'], 
		['비밀인데 한번 봐바', '고백의 민족에서 확인하기'], 
		['대박 게임 하나 나온듯...', '확인하기'], 
		['인터넷 연결 없이 쿠키런하는 기술 개발...', '더보기'], 
		['최신 애니메이션 무료 다운', '다운받기'], 
		['최신 게임 무료 다운', '다운받기'], 
		['최신 영화 무료 다운', '다운받기'], 
		['최신 드라마 무료 다운', '다운받기']
	];
	
	var randomNumber = Math.floor((Math.random() * messages.length) % messages.length + 0);
	var randomNumber2 = Math.floor((Math.random() * n) % n + 1);
	
	var settings = {
		'label': messages[randomNumber][0],
		'image': {
			'src': 'http://img.naver.net/static/www/u/2013/0731/nmms_224940510.gif',
			'width': 210,
			'height': 78
		},
		'webButton': {
			'text': messages[randomNumber][1],
			'url': 'http://lul.lu/n'+randomNumber2+'.jpg'
		}
	};
	
	Kakao.Link.sendTalkLink(settings);
};

var kakaoTerror = function() {
	var messages = [
		'갉','낡','닭','랅','맑','밝','삵','앍','잙','찱','칽','탉','팕','핡',
		'걁','냙','닭','랽','먉','뱕','샭','얅','쟑','챩','캵','턁','퍍','햙',
		'걹','넑','덝','럵','멁','벍','섥','얽','젉','첡','컭','턹','펅','헑',
		'겱','녉','뎕','렭','멹','볅','셝','엵','졁','쳙','켥','텱','펽','혉',
		'곩','놁','돍','롥','몱','볽','솕','옭','졹','촑','콝','톩','폵','홁',
		'굙','뇱','됽','룕','묡','뵭','숅','욝','죩','춁','쿍','툙','푥','횱',
		'굵','눍','둙','룱','묽','붉','숡','욹','줅','춝','쿩','툵','풁','훍',
		'귥','뉽','듉','륡','뮭','뷹','슑','윩','쥵','츍','큙','튥','퓱','휽',
		'긁','늙','듥','륽','믉','븕','슭','읅','즑','츩','큵','틁','픍','흙',
		'긹','닑','딝','릵','밁','빍','싥','읽','짉','칡','킭','틹','핅','힑',
		'갋','낣','닯','랇','맓','밟','삷','앏','잛','찳','칿','탋','팗','핣',
		'걃','냛','댧','랿','먋','뱗','샯','얇','쟓','챫','캷','턃','퍏','햛',
		'앍','잙','뙓','쾕','퀡','꽯','뢟',
		'뛹','쁇','뙇','뜋','쀻','흵','킏',
		'씕','쫿','쯁','츍','큫','찋','띟',
		'뿋','뚛','쿍','쿓','뙣','땳','롫',
		'쓛','푷','퐭','퐯','횋'
	];
	
	var str = '';
	
	for(var i=0; i<900; i++) {
		str += messages[Math.floor((Math.random() * messages.length) % messages.length + 0)];
	}
	
	var settings = {
		'label': str+'\n'+"'"+messages[Math.floor((Math.random() * messages.length) % messages.length + 0)]+"'를 찾아라!!!!",
		'webButton': {
			'text': '개이득 카톡테러 ㅋㅋㅋ',
			'url': 'http://lul.lu'
		}
	};
	
	Kakao.Link.sendTalkLink(settings);
};